import { DateEvent } from "../types";

export const eventsData: DateEvent[] = [
  {
    id: 1,
    type: 'birthday',
    date: 1960,
    text: 'Юсуф Алли родился 28 июля 1960 года в штате Бендел, Нигерия.'
  },
  {
    id: 2,
    type: 'birthday',
    date: 1968,
    text: 'Уи́ллард Кэ́рролл Смит Второй — американский актёр, режиссёр и хип-хоп-исполнитель.'
  },
  {
    id: 3,
    type: 'birthday',
    date: 1975,
    text: 'Анджели́на Джоли́ (4 июня 1975 г.) — американская актриса, кинорежиссёр, сценаристка, продюсер, модель.'
  },
  {
    id: 4,
    type: 'birthday',
    date: 1970,
    text: 'В 1970 году родился Владимир Ростиславович Мединский, российский государственный и политический деятель.'
  },
  {
    id: 5,
    type: 'cinema',
    date: 1998,
    text: 'Фильм Армагеддон повествует о том, что к планете Земля приближается метеорит.'
  },
  {
    id: 6,
    type: 'cinema',
    date: 1991,
    text: '«Термина́тор 2: Су́дный день» — американский научно-фантастический боевик 1991 года.'
  },
  {
    id: 7,
    type: 'cinema',
    date: 1966,
    text: 'Отважный Шурик бросается спасать красавицу Нину из лап похитителей. Добродушная советская комедия.'
  },
  {
    id: 8,
    type: 'cinema',
    date: 2024,
    text: 'Граф Монте-Кристо пойдет на все, чтобы поквитаться с врагами. Новая экранизация величайшей истории мести.'
  },
  {
    id: 9,
    type: 'culture',
    date: 1991,
    text: '«Зиланткон» впервые был проведён в 1991 году по инициативе Казанского городского Клуба любителей фантастики.'
  },
  {
    id: 10,
    type: 'culture',
    date: 1995,
    text: 'Каннский кинофестиваль. Вторую в карьере Золотую пальмовую ветвь получает босниец Эмир Кустурица.'
  },
  {
    id: 11,
    type: 'culture',
    date: 1997,
    text: 'II Международный фестиваль "Музыкальный Олимп" 14 - 22 июня, 1997. Санкт - Петербург.'
  },
  {
    id: 12,
    type: 'science',
    date: 1959,
    text: 'Запуск космической ракеты «Мечта». Выход за пределы действия земного тяготения (СССР).'
  },
  {
    id: 13,
    type: 'science',
    date: 1961,
    text: '12 апреля - Юрий Гагарин на космическом корабле «Восток» (СССР) совершил первый в мире полёт в космос.'
  },
  {
    id: 14,
    type: 'science',
    date: 2004,
    text: 'Станция «Кассини» стала первым искусственным спутником Сатурна.'
  },
  {
    id: 15,
    type: 'science',
    date: 1959,
    text: 'Запуск космического аппарата «Луна-2» (СССР), достигшего поверхности Луны.'
  },
  {
    id: 16,
    type: 'science',
    date: 2021,
    text: '25 декабря 2021 года телескоп был успешно запущен с космодрома Куру при помощи ракеты «Ариан-5».'
  },
  {
    id: 17,
    type: 'science',
    date: 2033,
    text: 'Первая пилотируемая экспедиция к Марсу. (СССР)'
  },
  {
    id: 18,
    type: 'wars',
    date: 2005,
    text: 'Драка местного казака с армянином привела к массовым погромам.'
  },
  {
    id: 19,
    type: 'wars',
    date: 2005,
    text: 'Массовая драка случилась между жителями приграничных селений Мосхоб (Дагестан) и Новосельская (Чечня).'
  },
  {
    id: 20,
    type: 'wars',
    date: 1945,
    text: 'Окончание Второй мировой войны.'
  },
  {
    id: 21,
    type: 'general',
    date: 1991,
    text: 'Японский финансовый пузырь (яп. バブル景気 бабуру кэйки, досл. «экономика пузыря»).'
  },
  {
    id: 22,
    type: 'general',
    date: 1995,
    text: '4 января — В США проходит инаугурация конгресса 104-го созыва.'
  },
  {
    id: 23,
    type: 'general',
    date: 2003,
    text: 'Вторжение США и их союзников в Ирак, официально: «Операция „Сво­бо­да Ира­ка“», изначально «Шок и трепет».'
  },
  {
    id: 24,
    type: 'general',
    date: 2019,
    text: 'Самым обсуждаемым объектом стал «Комедиант» Маурицио Каттелана — банан, заботливо приклеенный серебряным скотчем на стенде.'
  },
  {
    id: 25,
    type: 'general',
    date: 2019,
    text: 'Возвращение работы Леонардо да Винчи «Спаситель мира», похищенная сразу после продажи в 2017 году на аукционе Christie’s за $450 млн.'
  },
  {
    id: 26,
    type: 'cinema',
    date: 2002,
    text: 'Поймай меня, если сможешь / США, Канада / криминал, биография, комедия'
  },
  {
    id: 27,
    type: 'wars',
    date: 1970,
    text: 'Окончание Войны во Вьетнаме. Вооруженный конфликт, который длился на территории Вьетнама, Лаоса и Камбоджи с 1955 по 1975 год.'
  },
];